use mermaid svg
